# CurveElemArcRange Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CurveElemArcRange Property
ParameterTypeId Class See Also
---
"Range"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CurveElemArcRange { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CurveElemArcRange As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CurveElemArcRange {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace